'total_questions': 100, 'avg_retrieval': 0.73, 'avg_response': 0.69, 'overall_avg': 0.71,
{
"Emily": [["I recommended a science fiction movie before, what was it?",1,1],["When I was studying in the library, I read a novel. What was its name?",0,0],["What painters did you recommend to me?",1,1],["A few days ago, I mentioned that I had been to Green Wheat Park. Do you remember me saying what I saw there?",0,0],["I shared with you a literary film called "Taxi Driver", what is its content?",1,1],["I mentioned on May 2nd that I went to the museum. Do you remember what exhibition I saw then?",0,0],["On May 4th, I shared with you some problems I encountered. What were they about?",1,1]],
"Frank": [["On April 27th, how long did I run in the park?",0,0],["I once recommended a food program to you, what was its name?",1,1],["What are some good places for hiking in the suburbs that you have recommended to me?",1,1],["What type of music do I like to listen to?",1,1],["On May 6th, I read a book. What was its name?",0,0],["Why did I ask you for methods to relieve stress and relax my mood on April 30th?",1,1],["You once recommended a world history-related game to me. What was its name?",0,0]],
"Lucy": [["I recently went on a trip to Xiamen. What is my favorite attraction in Xiamen?",1,1],["I recently went to whose concert? What is my favorite song of theirs?",1,1],["What genres of movies do I like to watch?",1,1],["What kind of cuisine do I like?",1,1],["What methods have you told me about for relieving stress?",1,1],["What methods have you told me about for learning English listening and speaking?",1,1],["I don't like watching comedy movies, right?",1,1]],
"Sunny": [["Recently I've been exploring different workout methods.",0,0],["When I was taking photos in Mount Yuntai, what trouble did I encounter and who helped me?",0,0],["On May 3rd, which two movies did you recommend to me?",0,0],["On May 1st, I encountered something happy.?",0,0],["I don't like working out, right?",1,1],["You recommended a seaside city suitable for traveling to me, which one is it?",0,0],["What photography tips have you shared with me?",0,0]],
"Jason": [["Which country should I visit recently?",1,1],["What kind of cuisine do I like?",1,1],["I don't like outdoor activities, right?",1,1],["Which movie did you recommend to me?",1,1],["I went to visit the museum, and the exhibit that interested me the most was?",0,0],["What places do I like to shoot in?",1,1],["On May 4th, I consulted with you about what gift to give my friend. What did you recommend to me?",0,0]],
"Linda": [["On May 6th, I shared some books with you. Which books were they?",0,0],["On May 6th, I recommended some books to you. Which books were they?",0,0],["What topic did we talk about on April 27th?",1,1],["On April 28th, you recommended a note-taking software to me. What was its name?",1,1],["On May 2nd, I bought a dress, what's its color?",0,0],["On May 1st, I told you about my travel plans. Where did I plan to go?",0,0],["On May 4th, I told you about my travel plans. Where did I plan to go?",0,0]],
"John Zhang": [["I don't like warm weather, right?",1,1],["What topics did we talk about on April 29th?",0,0],["I have watched "Looking Up", what was the specific date of that day?",1,1],["What dish did I make on April 30th?",0,0],["What dish did I make on May 5th?",1,1],["I once watched a romance movie, what was its name?",1,1],["I shared a psychology book with you before about controlling emotions. What was its name?",1,1]],
"Ivy": [["Do you remember what we talked about during our first conversation?",0,0],["I once shared a movie with you: "The Pursuit of Happyness". What does it talk about?",1,1],["What was my mood on May 2nd?",1,1],["I once shared with you my experience of making sweet and sour fish. Do you remember the specific recipe?",0,0],["I have a badminton group. How many people are there in it?",1,1],["What suggestions did you give me about how to relax?",1,1],["About how to overcome anxiety and depression, what advice did you give me?",1,1]],
"Henry": [["I don't like playing badminton or running, right?",1,1],["What was the weather like on April 30th? What did I do?",0,0],["What advice did you give me about improving guitar skills?",1,1],["You recommended me a lot of books before, do you remember which ones?",0,0],["I once encountered a problem in learning programming, what was the problem?",1,1],["You once taught me how to make sweet and sour pork ribs. What is the recipe for it?",1,1],["What advice have you given me about living a healthy life?",1,1]],
"Gary": [["On April 28th, did I share with you my experience of making twice-cooked pork?",1,1],["I once consulted you about the learning methods and techniques of painting. What advice did you give me?",1,1],["You once recommended a few cooking shows to me. What were their names?",0,0],["You recommended me a book called "Way of the Peaceful Warrior: A Book That Changes Lives". What is the main content of this book?",1,1],["On May 2nd, we talked a lot. What topics did we discuss?",0,0],["You have recommended many famous racing competitions to me, what are some of them?",0,0],["What good ways did you recommend me to relieve stress?",1,1]],
"Jack": [["On April 27th, which music did you recommend to me?",1,1],["On April 27th, which movies did you recommend to me?",1,1],["What types of music do I like?",1,1],["I once shared an action movie with you, it's about police catching criminals, what was its name?",1,1],["What movie did I watch on May 3rd?",1,1],["On May 2nd, what Italian dishes did you recommend to me?",0,0],["May 4th is not my birthday, right?",1,1]],
"Roland": [["What are the games that you shared with me that were fun?",0,0],["Which movies did you share with me?",0,0],["On April 30th, we talked a lot. What topics did we talk about?",0,0],["On May 2nd, I was very upset. What caused my distress?",1,1],["I once consulted you on how to improve my programming efficiency. What advice did you give me?",1,1],["What outdoor sports do I enjoy?",1,1]],
"Susan": [["What kind of music do I like?",1,1],["What rock bands do I like?",0,0],["One of my paintings has been chosen for an exhibition. Do you still remember what inspired that piece of artwork?",1,1],["I once shared with you an emotional issue. What was it about?",1,1],["You once recommended me some handmade projects, what were they?",0,0]],
"Luna": [["What specific problems have I encountered at work recently? Why am I feeling unhappy?",1,1],["Why was I in a bad mood on April 30th, and what question did I ask you as a result?",1,1],["What's the weather like on May 4th? How am I feeling?",0,0],["I once consulted with you about ways to relax and reduce stress. What methods did you recommend to me?",1,1],["I once shared a movie with you, what was its name?",1,1]],
"Leo": [["What classical music pieces do I like?",1,1],["On May 2nd, which movie did I watch?",1,1],["What's my favorite scene in 'The Shawshank Redemption'?",1,1],["On May 3rd, what romance novels did you recommend to me?",0,0],["On May 3rd, what biographies did you recommend to me?",0,0],["What meditation apps did you recommend to me?",1,0.5],["On May 6th, why am I asking you for advice on how to relax muscles and stretch my body?",1,1]]
}
